nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_clock.h
/*! @brief List of master 2x clock source. */
typedef enum _clock_mstr_2x_clk_src
{
    kCLOCK_Mstr2xClkSrcMstrOsc = 0U, /*!< Master oscillator clock */
    kCLOCK_Mstr2xClkSrcPllDiv2 = 1U  /*!< PLL output divide 2 */
} clock_mstr_2x_clk_src_t;

/*! @brief List of output clock source. */
typedef enum _clock_output_clk_src
{
    kCLOCK_OutputClkSrc_Bus      = 0U, /*!< Bus clock */
    kCLOCK_OutputClkSrc_Bus2x    = 1U, /*!< Bus 2x clock */
    kCLOCK_OutputClkSrc_BusDiv4  = 2U, /*!< Bus clock div 4 */
    kCLOCK_OutputClkSrc_MstrOSC  = 3U, /*!< Master oscillator clock */
    kCLOCK_OutputClkSrc_FircDiv6 = 4U, /*!< 8M clock, FIRC/6 */
    kCLOCK_OutputClkSrc_Sirc     = 5U  /*!< 200K clock, SIRC*/
} clock_output_clk_src_t;

/*! @brief List of output clock divider. */
typedef enum _clock_output_clk_div
{
    kCLOCK_OutputDiv1   = 0U, /*!< output clock = selectedClock/1U */
    kCLOCK_OutputDiv2   = 1U, /*!< output clock = selectedClock/2U */
    kCLOCK_OutputDiv4   = 2U, /*!< output clock = selectedClock/4U */
    kCLOCK_OutputDiv8   = 3U, /*!< output clock = selectedClock/8U */
    kCLOCK_OutputDiv16  = 4U, /*!< output clock = selectedClock/16U */
    kCLOCK_OutputDiv32  = 5U, /*!< output clock = selectedClock/32U */
    kCLOCK_OutputDiv64  = 6U, /*!< output clock = selectedClock/64U */
    kCLOCK_OutputDiv128 = 7U  /*!< output clock = selectedClock/128U */
} clock_output_clk_div_t;

/*! @brief List of clock register protection mode. */
typedef enum _clock_protection
{
    kCLOCK_Protection_Off     = 0U, /*!< No protection, and could be changed any time */
    kCLOCK_Protection_On      = 1U, /*!< Protected, and could be changed any time */
    kCLOCK_Protection_OffLock = 2U, /*!< No protection and get locked until chip reset */
    kCLOCK_Protection_OnLock  = 3U  /*!< Protected and get locked until chip reset */
} clock_protection_t;

/*! @brief List of specific IP's clock source. */
typedef enum _clock_ip_clk_src
{
    kCLOCK_IPClkSrc_BusClk   = 0U, /*!< Bus clock */
    kCLOCK_IPClkSrc_Bus2xClk = 1U  /*!< Bus 2x clock */
} clock_ip_clk_src_t;

/*! @brief Mstr 2x clock postscale divider. */
typedef enum _clock_postscale
{
    kCLOCK_PostscaleDiv1   = 0, /*!< Mast 2X clock = clkSrc / 1 */
    kCLOCK_PostscaleDiv2   = 1, /*!< Mast 2X clock = clkSrc / 2 */
    kCLOCK_PostscaleDiv4   = 2, /*!< Mast 2X clock = clkSrc / 4 */
    kCLOCK_PostscaleDiv8   = 3, /*!< Mast 2X clock = clkSrc / 8 */
    kCLOCK_PostscaleDiv16  = 4, /*!< Mast 2X clock = clkSrc / 16 */
    kCLOCK_PostscaleDiv32  = 5, /*!< Mast 2X clock = clkSrc / 32 */
    kCLOCK_PostscaleDiv64  = 6, /*!< Mast 2X clock = clkSrc / 64 */
    kCLOCK_PostscaleDiv128 = 7, /*!< Mast 2X clock = clkSrc / 128 */
    kCLOCK_PostscaleDiv256 = 8, /*!< Mast 2X clock = clkSrc / 256 */
} clock_postscale_t;

/*! @brief Clock register protection configuration. */
typedef struct _clock_protection_config
{
    clock_protection_t eFrqEP; /*!< FRQEP bit field in OCCS PROT register, protect COD & ZSRC. */
    clock_protection_t eOscEP; /*!< OSCEP bit field in OCCS PROT register, protect OSCTL1, OSCTL2, PRECS. */
    clock_protection_t
        ePllEP; /*!< PLLEP bit field in OCCS PROT register, protect PLLDP, LOCIE, LORTP, PLLDB bitfield. */
} clock_protection_config_t;

/*! @brief Clock output configuration. */
typedef struct _clock_output_config
{
    bool bClkOut0En;                    /*!< Clock output 0 enable, CLKDIS0 bit field in SIM CLKOUT register*/
    bool bClkOut1En;                    /*!< Clock output 1 enable, CLKDIS1 bit field in SIM CLKOUT register*/
    clock_output_clk_src_t eClkOut0Src; /*!< Clock output 0 clock source, CLKOSEL0 bit field in SIM CLKOUT register*/
    clock_output_clk_src_t eClkOut1Src; /*!< Clock output 1 clock source, CLKOSEL1 bit field in SIM CLKOUT register*/
    clock_output_clk_div_t
        eClkDiv; /*!< Clock output divider, CLKODIV bit field in SIM CLKOUT register ,it apply to clkout0 & clkout1*/
} clock_output_config_t;

/*!
 * @brief mcu clock configuration structure.
 *
 * This is the key configuration structure of clock driver, which define the system
 * clock behave. The function CLOCK_SetClkConfig deploy this configuration structure onto SOC.
 * */
typedef struct _clock_config
{
    bool bCrystalOscEnable; /*!< Crystal oscillator enable, COPD bit field in OCCS OSCTL2 register*/
    bool bFircEnable;       /*!< Fast internal RC oscillator enable, IRC48M_EN bit field in SIM MISC0 register*/
    bool bSircEnable;       /*!< Slow internal RC oscillator enable, ROPD200K bit field in OCCS OSCTL2 register*/
    bool bPllEnable;        /*!< PLL enable, PLLPD bit field in OCCS CTRL register*/
    bool
        bCrystalOscMonitorEnable; /*!< Crystal oscillator monitor enable, MON_ENABLE bit field in OCCS OSCTL2 register*/
    clock_crystal_osc_mode_t eCrystalOscMode; /*!< Crystal oscillator mode, COHL bit field in OCCS OSCTL1 register*/
    clock_ext_clk_src_t eExtClkSrc;           /*!< External clock source, EXT_SEL bit field in OCCS OSCTL1 register*/
    clock_ext_clkin_sel_t eClkInSel;         /*!< Clock IN selection(0 or 1), CLKINSEL bit field in SIM MISC0 register*/
    clock_mstr_osc_clk_src_t eMstrOscClkSrc; /*!< Master oscillator selection, PRECS bit field in OCCS CTRL register.
                                               When selected kCLOCK_MstrOscClkSrcExt, make sure corresponding
                                               pins(crystal osc or clkin pin) has been configured. */
    clock_mstr_2x_clk_src_t eMstr2xClkSrc;   /*!< Master 2x clock selection, ZSRC bit field in OCCS CTRL register*/
    clock_postscale_t eMstr2xClkPostScale;   /*!< Master 2x clock post scale, COD bit field in OCCS DIVBY register*/
    uint32_t u32PllClkFreq;                  /*!< Required PLL output frequency before divide 2 */
} clock_config_t;

/*! @brief PLL monitor type structure. */
typedef enum _clock_pll_monitor_type
{
    kCLOCK_PllMonitorUnLockCoarse,   /*!< PLL coarse unlock, due to loss of reference clock, power unstable...etc. */
    kCLOCK_PllMonitorUnLockFine,     /*!< PLL fine unlock, due to loss of reference clock, power unstable...etc. */
    kCLOCK_PllMonitorLostofReferClk, /*!< PLL lost reference clock. */
    kCLOCK_PllMonitorAll             /*!< All PLL monitor type. */
} clock_pll_monitor_type_t;

/*! @brief Describes PIT clock source. */
typedef enum _pit_count_clock_source
{
    /* This part is used for PIT driver. */
    kPIT_CountClockSource0 = 0U, /*!< PIT count clock sourced from IP bus clock */
    kPIT_CountClockSource1 = 1U, /*!< PIT count clock sourced from alternate clock 1 */
    kPIT_CountClockSource2 = 2U, /*!< PIT count clock sourced from alternate clock 2 */
    kPIT_CountClockSource3 = 3U, /*!< PIT count clock sourced from alternate clock 3 */
    /* This part is used for users. */
    kPIT_CountBusClock       = kPIT_CountClockSource0, /*!< PIT count clock sourced from IP bus clock */
    kPIT_CountCrystalClock   = kPIT_CountClockSource1, /*!< PIT count clock sourced from crystal clock */
    kPIT_Count8MHzIRCClock   = kPIT_CountClockSource2, /*!< PIT count clock sourced from 8MHz IRC clock */
    kPIT_Count200KHzIRCClock = kPIT_CountClockSource3, /*!< PIT count clock sourced from 200KHz IRC clock */
} pit_count_clock_source_t;

